benchmark_results/detail_500.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.58
Server Hostname:        localhost
Server Port:            80

Document Path:          /tokoprima/public/transaksi_detail.php?id=TR-001
Document Length:        10469 bytes

Concurrency Level:      5
Time taken for tests:   1.174 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      5388000 bytes
HTML transferred:       5234500 bytes
Requests per second:    426.02 [#/sec] (mean)
Time per request:       11.737 [ms] (mean)
Time per request:       2.347 [ms] (mean, across all concurrent requests)
Transfer rate:          4483.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       1
Processing:     6    9  10.8      9     249
Waiting:        5    9  10.8      8     247
Total:          7   10  10.8      9     249

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     10
  80%     11
  90%     11
  95%     12
  98%     12
  99%     13
 100%    249 (longest request)