benchmark_results/transaksi_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.58
Server Hostname:        localhost
Server Port:            80

Document Path:          /tokoprima/public/transaksi.php
Document Length:        147615 bytes

Concurrency Level:      10
Time taken for tests:   4.659 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      147922000 bytes
HTML transferred:       147615000 bytes
Requests per second:    214.65 [#/sec] (mean)
Time per request:       46.587 [ms] (mean)
Time per request:       4.659 [ms] (mean, across all concurrent requests)
Transfer rate:          31007.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       1
Processing:     8   43  10.3     42     354
Waiting:        7   42  10.2     41     351
Total:          8   43  10.3     43     355

Percentage of the requests served within a certain time (ms)
  50%     43
  66%     44
  75%     44
  80%     45
  90%     46
  95%     47
  98%     49
  99%     50
 100%    355 (longest request)